el_acsiography = {
    'Заповнення документації': [[5.0, 0.08], [0, 0], [1.7, 0.02]],
    'Первинне обстеження і підготовка до дослідження': [[10, 0.16], [0, 0], [3.3, 0.05]],
    'Адаптація параоклюзійної прикусної вилки': [[30.0, 0.5], [0, 0], [10.0, 0.16]],
    'Підключення і калібрування аксіографа': [[15.0, 0.25], [0, 0],[5.0, 0.08]],
    'Власне реєстрація рухів нижньої щелепи': [[30.0, 0.5], [0, 0], [10.0, 0.16]],
    'Зняття пристроя і очищення зубів пацієнта': [[15.0, 0.25], [0, 0], [5.0, 0.08]],
    'Аналіз отриманих даних та підготовка заключення': [[60.0, 1], [0, 0], [20.0, 0.33]]
}

jva = {
    'Заповнення документації': [[15.0, 0.25],[0, 0], [5.0, 0.08]],
    'Первинне обстеження і підготовка до дослідження': [[15.0, 0.25], [0, 0],[5.0, 0.08]],
    'Оцінка ступеня відкривання рота та рухів нижньої щелепи': [[10.0, 0.16], [0, 0], [3.3, 0.05]],
    'Запис даних прибором': [[15.0, 0.25], [0, 0], [5.0, 0.08]],
    'Аналіз отриманих даних і підготовка заключення': [[30.0, 0.5], [0, 0], [10.0, 0.16]]
}

el_miography = {
    'Заповнення документації': [[5.0, 0.08],[0, 0], [1.7, 0.02]],
    'Первинне обстеження і підготовка до дослідження': [[5.0, 0.08], [0, 0],[1.7, 0.02]],
    'Підготовка та накладання електродів': [[10.0, 0.16], [0, 0], [3.3, 0.05]],
    'Власне запис електоміограми': [[30.0, 0.5], [0, 0], [10.0, 0.16]],
    'Зняття електодів': [[5.0, 0.08], [0, 0], [1.7, 0.02]],
    'Аналіз отриманих даних та підготовка заключення': [[45.0, 0.75], [0, 0], [15, 0.25]]
}

t_scan = {
    'Заповнення документації': [[5.0, 0.08],[0, 0], [1.7, 0.02]],
    'Первинне обстеження і підготовка до дослідження': [[15.0, 0.25], [0, 0],[5, 0.08]],
    'Запис оклюдограми': [[30.0, 0.5], [0, 0], [10, 0.16]],
    'Аналіз отриманих даних та підготовка заключення': [[60.0, 1], [0, 0], [20, 0.33]]
}

segmentation = {
    'Сегментація': [[60.0, 1],[0, 0], [20, 0.33]],
    'Постановка точок': [[30.0, 0.5], [0, 0],[10, 0.16]],
    'Аналіз результатів (за одним автором) та підготовка заключень': [[30.0, 0.5], [0, 0], [10, 0.16]]
}


def calculate_time(dict_object, choices_object):
    
    doctor = sum(dict_object[value][0][0] for value in choices_object)
    doctor_yop = sum(dict_object[value][0][1] for value in choices_object)

    ms = sum(dict_object[value][2][0] for value in choices_object)
    ms_yop = sum(dict_object[value][2][1] for value in choices_object)

    doctor_yop = round(doctor_yop, 2)
    ms_yop = round(ms_yop, 2)

    return doctor, doctor_yop, ms, ms_yop